jaszczurtd/JaszczurHAL/src/hal/impl/rp2040/hal_tcp.cpp
#include "hal/core/hal_target.h"
#if HAL_TARGET_IS_RP
#include "hal/core/hal_config.h"

#ifdef HAL_ENABLE_TCP

#include "hal/network/jh_network_backend.h"
#define hal_tcp_socket_impl_t jh_cyw43_tcp_socket_impl_t
#define hal_tcp_listener_impl_t jh_cyw43_tcp_listener_impl_t
#define hal_tcp_socket_t jh_cyw43_tcp_socket_t
#define hal_tcp_listener_t jh_cyw43_tcp_listener_t
#define hal_tcp_socket_open_ex jh_cyw43_tcp_socket_open_ex
#define hal_tcp_socket_open jh_cyw43_tcp_socket_open
#define hal_tcp_socket_connect_ex jh_cyw43_tcp_socket_connect_ex
#define hal_tcp_socket_connect jh_cyw43_tcp_socket_connect
#define hal_tcp_socket_send_ex jh_cyw43_tcp_socket_send_ex
#define hal_tcp_socket_send jh_cyw43_tcp_socket_send
#define hal_tcp_socket_recv_ex jh_cyw43_tcp_socket_recv_ex
#define hal_tcp_socket_recv jh_cyw43_tcp_socket_recv
#define hal_tcp_socket_can_recv jh_cyw43_tcp_socket_can_recv
#define hal_tcp_socket_can_send jh_cyw43_tcp_socket_can_send
#define hal_tcp_socket_is_connected jh_cyw43_tcp_socket_is_connected
#define hal_tcp_socket_shutdown jh_cyw43_tcp_socket_shutdown
#define hal_tcp_socket_close jh_cyw43_tcp_socket_close
#define hal_tcp_listener_open_ex jh_cyw43_tcp_listener_open_ex
#define hal_tcp_listener_open jh_cyw43_tcp_listener_open
#define hal_tcp_listener_bind_ex jh_cyw43_tcp_listener_bind_ex
#define hal_tcp_listener_bind jh_cyw43_tcp_listener_bind
#define hal_tcp_listener_listen_ex jh_cyw43_tcp_listener_listen_ex
#define hal_tcp_listener_listen jh_cyw43_tcp_listener_listen
#define hal_tcp_listener_accept_ex jh_cyw43_tcp_listener_accept_ex
#define hal_tcp_listener_accept jh_cyw43_tcp_listener_accept
#define hal_tcp_listener_can_accept jh_cyw43_tcp_listener_can_accept
#define hal_tcp_listener_close jh_cyw43_tcp_listener_close

#include "hal/core/hal_mutex_once.h"
#include "hal/network/hal_tcp.h"
#include "hal/network/jh_net_address_utils.h"
#include "hal/serial/hal_serial.h"
#include "hal/system/hal_sync.h"
#include "hal/system/hal_system.h"

#include "drivers/rp2040/rp2040_cyw43_provider.h"
#include "hal/network/jh_lwip_tcp.h"
#include "rp2040_network_lifecycle.h"
#include <limits.h>
#include <string.h>

struct hal_tcp_socket_impl_t {
  jh_lwip_tcp_socket_t client;
  bool in_use;
  bool connected;
  hal_net_endpoint_t remote_endpoint;
};

struct hal_tcp_listener_impl_t {
  jh_lwip_tcp_listener_t listener;
  bool in_use;
  bool bound;
  bool listening;
  hal_net_endpoint_t local_endpoint;
  uint8_t backlog;
};

static hal_tcp_socket_impl_t s_tcp_pool[HAL_TCP_SOCKET_MAX_INSTANCES];
static hal_tcp_listener_impl_t
    s_tcp_listener_pool[HAL_TCP_LISTENER_MAX_INSTANCES];
static hal_mutex_t s_tcp_mutex = NULL;

static inline void tcp_ensure_mutex(void) {
  (void)jh_hal_mutex_create_once(&s_tcp_mutex);
}

static void reset_socket_state_locked(hal_tcp_socket_impl_t *socket);
static void reset_listener_state_locked(hal_tcp_listener_impl_t *listener);

extern "C" hal_status_t jh_rp2040_tcp_reset_all(void) {
  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);
  const hal_status_t status = jh_rp2040_cyw43_provider_lwip_begin(false);
  if (status == HAL_OK) {
    for (size_t index = 0u; index < HAL_TCP_SOCKET_MAX_INSTANCES; ++index) {
      if (s_tcp_pool[index].in_use) {
        jh_lwip_tcp_socket_close(&s_tcp_pool[index].client);
        reset_socket_state_locked(&s_tcp_pool[index]);
        s_tcp_pool[index].in_use = false;
      }
    }
    for (size_t index = 0u; index < HAL_TCP_LISTENER_MAX_INSTANCES; ++index) {
      if (s_tcp_listener_pool[index].in_use) {
        jh_lwip_tcp_listener_close(&s_tcp_listener_pool[index].listener);
        reset_listener_state_locked(&s_tcp_listener_pool[index]);
        s_tcp_listener_pool[index].in_use = false;
      }
    }
    jh_rp2040_cyw43_provider_lwip_end();
  }
  hal_mutex_unlock(s_tcp_mutex);
  return status;
}

static void reset_endpoint(hal_net_endpoint_t *endpoint) {
  if (!endpoint) {
    return;
  }
  memset(endpoint, 0, sizeof(*endpoint));
  endpoint->family = HAL_NET_AF_UNSPEC;
}

static hal_status_t validate_endpoint(const hal_net_endpoint_t *endpoint,
                                      bool allow_unspecified_address,
                                      const char *fn, const char *name) {
  const hal_status_t shape =
      jh_net_validate_endpoint_shape(endpoint, true, allow_unspecified_address);
  if (shape != HAL_OK) {
    hal_derr("%s: %s endpoint is malformed", fn, name);
    return shape;
  }
  if (endpoint->family != HAL_NET_AF_INET) {
    hal_derr("%s: %s endpoint family is unsupported", fn, name);
    return HAL_EUNSUPPORTED;
  }
  return HAL_OK;
}

static bool is_valid_socket_locked(hal_tcp_socket_t socket) {
  for (size_t i = 0u; i < HAL_TCP_SOCKET_MAX_INSTANCES; ++i) {
    if (socket == &s_tcp_pool[i] && s_tcp_pool[i].in_use) {
      return true;
    }
  }
  return false;
}

static bool is_valid_listener_locked(hal_tcp_listener_t listener) {
  for (size_t i = 0u; i < HAL_TCP_LISTENER_MAX_INSTANCES; ++i) {
    if (listener == &s_tcp_listener_pool[i] && s_tcp_listener_pool[i].in_use) {
      return true;
    }
  }
  return false;
}

static uint8_t capped_backlog(uint8_t backlog) {
  if ((size_t)backlog > (size_t)HAL_TCP_LISTENER_BACKLOG_MAX) {
    return (uint8_t)HAL_TCP_LISTENER_BACKLOG_MAX;
  }
  return backlog;
}

static void reset_socket_state_locked(hal_tcp_socket_impl_t *socket) {
  jh_lwip_tcp_socket_init(&socket->client);
  socket->connected = false;
  reset_endpoint(&socket->remote_endpoint);
}

static hal_tcp_socket_t allocate_socket_locked(void) {
  for (size_t i = 0u; i < HAL_TCP_SOCKET_MAX_INSTANCES; ++i) {
    if (!s_tcp_pool[i].in_use) {
      reset_socket_state_locked(&s_tcp_pool[i]);
      s_tcp_pool[i].in_use = true;
      return &s_tcp_pool[i];
    }
  }
  return NULL;
}

static void reset_listener_state_locked(hal_tcp_listener_impl_t *listener) {
  jh_lwip_tcp_listener_init(&listener->listener);
  listener->backlog = 0u;
  listener->bound = false;
  listener->listening = false;
  reset_endpoint(&listener->local_endpoint);
}

hal_status_t hal_tcp_socket_open_ex(hal_tcp_socket_t *out_socket) {
  if (!out_socket) {
    return HAL_EINVAL;
  }
  *out_socket = NULL;
  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  *out_socket = allocate_socket_locked();

  hal_mutex_unlock(s_tcp_mutex);

