jaszczurtd/JaszczurHAL/src/hal/impl/rp2040/hal_tcp.cpp
    if (timeout_ms == 0u) {
      return HAL_OK;
    }
    if (timeout_ms != HAL_NET_TIMEOUT_FOREVER &&
        (uint32_t)(hal_millis() - start_ms) >= timeout_ms) {
      return HAL_OK;
    }

    hal_idle();
    hal_delay_ms(1u);
  }
}

int hal_tcp_socket_recv(hal_tcp_socket_t socket, void *buffer, size_t max_len,
                        uint32_t timeout_ms) {
  size_t received = 0u;
  return hal_status_is_ok(hal_tcp_socket_recv_ex(socket, buffer, max_len,
                                                 timeout_ms, &received))
             ? (int)received
             : -1;
}

bool hal_tcp_socket_can_recv(hal_tcp_socket_t socket) {
  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  bool ready = false;
  if (is_valid_socket_locked(socket)) {
    const hal_status_t context_status =
        jh_rp2040_cyw43_provider_lwip_begin(false);
    if (context_status == HAL_OK) {
      ready = jh_lwip_tcp_socket_available(&socket->client) > 0u;
      socket->connected = jh_lwip_tcp_socket_is_connected(&socket->client);
      jh_rp2040_cyw43_provider_lwip_end();
    }
  }

  hal_mutex_unlock(s_tcp_mutex);
  return ready;
}

bool hal_tcp_socket_can_send(hal_tcp_socket_t socket) {
  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  bool ready = false;
  if (is_valid_socket_locked(socket)) {
    const hal_status_t context_status =
        jh_rp2040_cyw43_provider_lwip_begin(false);
    if (context_status == HAL_OK) {
      ready = jh_lwip_tcp_socket_can_send(&socket->client);
      socket->connected = jh_lwip_tcp_socket_is_connected(&socket->client);
      jh_rp2040_cyw43_provider_lwip_end();
    }
  }

  hal_mutex_unlock(s_tcp_mutex);
  return ready;
}

bool hal_tcp_socket_is_connected(hal_tcp_socket_t socket) {
  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  bool connected = false;
  if (is_valid_socket_locked(socket)) {
    const hal_status_t context_status =
        jh_rp2040_cyw43_provider_lwip_begin(false);
    if (context_status == HAL_OK) {
      connected = jh_lwip_tcp_socket_is_connected(&socket->client);
      socket->connected = connected;
      jh_rp2040_cyw43_provider_lwip_end();
    }
  }

  hal_mutex_unlock(s_tcp_mutex);
  return connected;
}

void hal_tcp_socket_shutdown(hal_tcp_socket_t socket) {
  if (!socket) {
    return;
  }

  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  if (is_valid_socket_locked(socket)) {
    const hal_status_t context_status =
        jh_rp2040_cyw43_provider_lwip_begin(false);
    if (context_status == HAL_OK) {
      jh_lwip_tcp_socket_close(&socket->client);
      jh_rp2040_cyw43_provider_lwip_end();
    }
    socket->connected = false;
    reset_endpoint(&socket->remote_endpoint);
  }

  hal_mutex_unlock(s_tcp_mutex);
}

void hal_tcp_socket_close(hal_tcp_socket_t socket) {
  if (!socket) {
    return;
  }

  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  if (is_valid_socket_locked(socket)) {
    const hal_status_t context_status =
        jh_rp2040_cyw43_provider_lwip_begin(false);
    if (context_status == HAL_OK) {
      jh_lwip_tcp_socket_close(&socket->client);
      jh_rp2040_cyw43_provider_lwip_end();
    }
    reset_socket_state_locked(socket);
    socket->in_use = false;
  }

  hal_mutex_unlock(s_tcp_mutex);
}

hal_status_t hal_tcp_listener_open_ex(hal_tcp_listener_t *out_listener) {
  if (!out_listener) {
    return HAL_EINVAL;
  }
  *out_listener = NULL;
  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  for (size_t i = 0u; i < HAL_TCP_LISTENER_MAX_INSTANCES; ++i) {
    if (!s_tcp_listener_pool[i].in_use) {
      reset_listener_state_locked(&s_tcp_listener_pool[i]);
      s_tcp_listener_pool[i].in_use = true;
      *out_listener = &s_tcp_listener_pool[i];
      break;
    }
  }

  hal_mutex_unlock(s_tcp_mutex);
  if (!*out_listener) {
    hal_derr("hal_tcp_listener_open: listener pool exhausted");
    return HAL_ENOMEM;
  }
  return HAL_OK;
}

hal_tcp_listener_t hal_tcp_listener_open(void) {
  hal_tcp_listener_t listener = NULL;
  (void)hal_tcp_listener_open_ex(&listener);
  return listener;
}

hal_status_t hal_tcp_listener_bind_ex(hal_tcp_listener_t listener,
                                      const hal_net_endpoint_t *local) {
  const hal_status_t endpoint_status =
      validate_endpoint(local, true, "hal_tcp_listener_bind", "local");
  if (endpoint_status != HAL_OK) {
    return endpoint_status;
  }

  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);
  if (!is_valid_listener_locked(listener)) {
    hal_mutex_unlock(s_tcp_mutex);
    hal_derr("hal_tcp_listener_bind: listener handle is invalid");
    return HAL_EINVAL;
  }

  ip4_addr_t local_address;
  IP4_ADDR(&local_address, local->addr[0], local->addr[1], local->addr[2],
           local->addr[3]);
  hal_status_t status = jh_rp2040_cyw43_provider_lwip_begin(true);
  const bool context_active = status == HAL_OK;
  if (status == HAL_OK) {
    status = jh_lwip_tcp_listener_bind(&listener->listener, &local_address,
                                       local->port);
    jh_rp2040_cyw43_provider_lwip_end();
  }
  if (status == HAL_OK) {
    listener->local_endpoint = *local;
    listener->bound = true;
    listener->listening = false;
    listener->backlog = 0u;
  } else if (context_active) {
    reset_listener_state_locked(listener);
  }
  hal_mutex_unlock(s_tcp_mutex);
  return status;
}

bool hal_tcp_listener_bind(hal_tcp_listener_t listener,
                           const hal_net_endpoint_t *local) {
  return hal_status_to_bool(hal_tcp_listener_bind_ex(listener, local));
}

hal_status_t hal_tcp_listener_listen_ex(hal_tcp_listener_t listener,
                                        uint8_t backlog) {
  if (backlog == 0u) {
    hal_derr("hal_tcp_listener_listen: backlog must be > 0");
    return HAL_EINVAL;
  }

  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);
  if (!is_valid_listener_locked(listener)) {
    hal_mutex_unlock(s_tcp_mutex);
    hal_derr("hal_tcp_listener_listen: listener is invalid");
    return HAL_EINVAL;
  }
  if (!listener->bound) {
    hal_mutex_unlock(s_tcp_mutex);
    hal_derr("hal_tcp_listener_listen: listener is not bound");
    return HAL_ESTATE;
  }

  const uint8_t effective_backlog = capped_backlog(backlog);
  hal_status_t status = jh_rp2040_cyw43_provider_lwip_begin(true);
  if (status == HAL_OK) {
    status =
        jh_lwip_tcp_listener_listen(&listener->listener, effective_backlog);
    jh_rp2040_cyw43_provider_lwip_end();
  }
  if (status == HAL_OK) {
    listener->backlog = effective_backlog;
    listener->listening = true;
  }
  hal_mutex_unlock(s_tcp_mutex);
  return status;
}

bool hal_tcp_listener_listen(hal_tcp_listener_t listener, uint8_t backlog) {
  return hal_status_to_bool(hal_tcp_listener_listen_ex(listener, backlog));
}

hal_status_t hal_tcp_listener_accept_ex(hal_tcp_listener_t listener,
                                        hal_net_endpoint_t *remote,
                                        uint32_t timeout_ms,
                                        hal_tcp_socket_t *out_socket) {
  if (!out_socket) {
    return HAL_EINVAL;
  }
  *out_socket = NULL;
  const uint32_t start_ms = hal_millis();

