jaszczurtd/JaszczurHAL/src/hal/impl/rp2040/hal_tcp.cpp
  for (;;) {
    tcp_ensure_mutex();
    hal_mutex_lock(s_tcp_mutex);
    if (!is_valid_listener_locked(listener)) {
      hal_mutex_unlock(s_tcp_mutex);
      hal_derr("hal_tcp_listener_accept: listener is invalid");
      return HAL_EINVAL;
    }
    if (!listener->listening) {
      hal_mutex_unlock(s_tcp_mutex);
      hal_derr("hal_tcp_listener_accept: listener is not listening");
      return HAL_ESTATE;
    }

    hal_status_t status = jh_rp2040_cyw43_provider_lwip_begin(false);
    const bool context_active = status == HAL_OK;
    hal_tcp_socket_t socket = NULL;
    if (context_active) {
      if (!jh_lwip_tcp_listener_can_accept(&listener->listener)) {
        status = HAL_EAGAIN;
      } else {
        socket = allocate_socket_locked();
        if (!socket) {
          status = HAL_ENOMEM;
        } else {
          ip4_addr_t remote_address;
          uint16_t remote_port = 0u;
          status =
              jh_lwip_tcp_listener_accept(&listener->listener, &socket->client,
                                          &remote_address, &remote_port);
          if (status == HAL_OK) {
            socket->connected =
                jh_lwip_tcp_socket_is_connected(&socket->client);
            memset(&socket->remote_endpoint, 0,
                   sizeof(socket->remote_endpoint));
            socket->remote_endpoint.family = HAL_NET_AF_INET;
            socket->remote_endpoint.addr_len = HAL_NET_IPV4_ADDR_LEN;
            socket->remote_endpoint.addr[0] = ip4_addr1(&remote_address);
            socket->remote_endpoint.addr[1] = ip4_addr2(&remote_address);
            socket->remote_endpoint.addr[2] = ip4_addr3(&remote_address);
            socket->remote_endpoint.addr[3] = ip4_addr4(&remote_address);
            socket->remote_endpoint.port = remote_port;
          } else {
            reset_socket_state_locked(socket);
            socket->in_use = false;
            socket = NULL;
          }
        }
      }
    }
    if (context_active) {
      jh_rp2040_cyw43_provider_lwip_end();
    }
    hal_mutex_unlock(s_tcp_mutex);

    if (status == HAL_OK && socket) {
      if (remote) {
        *remote = socket->remote_endpoint;
      }
      *out_socket = socket;
      return HAL_OK;
    }
    if (status != HAL_EAGAIN) {
      return status;
    }
    if (timeout_ms == 0u ||
        (timeout_ms != HAL_NET_TIMEOUT_FOREVER &&
         (uint32_t)(hal_millis() - start_ms) >= timeout_ms)) {
      return HAL_EAGAIN;
    }
    hal_idle();
    hal_delay_ms(1u);
  }
}

hal_tcp_socket_t hal_tcp_listener_accept(hal_tcp_listener_t listener,
                                         hal_net_endpoint_t *remote,
                                         uint32_t timeout_ms) {
  hal_tcp_socket_t socket = NULL;
  (void)hal_tcp_listener_accept_ex(listener, remote, timeout_ms, &socket);
  return socket;
}

bool hal_tcp_listener_can_accept(hal_tcp_listener_t listener) {
  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);
  bool ready = false;
  if (is_valid_listener_locked(listener) && listener->listening) {
    const hal_status_t status = jh_rp2040_cyw43_provider_lwip_begin(false);
    if (status == HAL_OK) {
      ready = jh_lwip_tcp_listener_can_accept(&listener->listener);
      jh_rp2040_cyw43_provider_lwip_end();
    }
  }
  hal_mutex_unlock(s_tcp_mutex);
  return ready;
}

void hal_tcp_listener_close(hal_tcp_listener_t listener) {
  if (!listener) {
    return;
  }

  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);
  if (is_valid_listener_locked(listener)) {
    const hal_status_t status = jh_rp2040_cyw43_provider_lwip_begin(false);
    if (status == HAL_OK) {
      jh_lwip_tcp_listener_close(&listener->listener);
      jh_rp2040_cyw43_provider_lwip_end();
    }
    reset_listener_state_locked(listener);
    listener->in_use = false;
  }
  hal_mutex_unlock(s_tcp_mutex);
}

static hal_status_t backend_socket_open(void **out_socket) {
  if (out_socket == nullptr) {
    return HAL_EINVAL;
  }
  hal_tcp_socket_t socket = nullptr;
  const hal_status_t status = hal_tcp_socket_open_ex(&socket);
  *out_socket = socket;
  return status;
}

static hal_status_t backend_socket_connect(void *socket,
                                           const hal_net_endpoint_t *remote,
                                           uint32_t timeout_ms) {
  return hal_tcp_socket_connect_ex(static_cast<hal_tcp_socket_t>(socket),
                                   remote, timeout_ms);
}

static hal_status_t backend_socket_send(void *socket, const void *data,
                                        size_t len, size_t *out_sent) {
  return hal_tcp_socket_send_ex(static_cast<hal_tcp_socket_t>(socket), data,
                                len, out_sent);
}

static hal_status_t backend_socket_recv(void *socket, void *buffer,
                                        size_t max_len, uint32_t timeout_ms,
                                        size_t *out_received) {
  return hal_tcp_socket_recv_ex(static_cast<hal_tcp_socket_t>(socket), buffer,
                                max_len, timeout_ms, out_received);
}

static bool backend_socket_can_recv(void *socket) {
  return hal_tcp_socket_can_recv(static_cast<hal_tcp_socket_t>(socket));
}

static bool backend_socket_can_send(void *socket) {
  return hal_tcp_socket_can_send(static_cast<hal_tcp_socket_t>(socket));
}

static bool backend_socket_is_connected(void *socket) {
  return hal_tcp_socket_is_connected(static_cast<hal_tcp_socket_t>(socket));
}

static void backend_socket_shutdown(void *socket) {
  hal_tcp_socket_shutdown(static_cast<hal_tcp_socket_t>(socket));
}

static void backend_socket_close(void *socket) {
  hal_tcp_socket_close(static_cast<hal_tcp_socket_t>(socket));
}

static hal_status_t backend_listener_open(void **out_listener) {
  if (out_listener == nullptr) {
    return HAL_EINVAL;
  }
  hal_tcp_listener_t listener = nullptr;
  const hal_status_t status = hal_tcp_listener_open_ex(&listener);
  *out_listener = listener;
  return status;
}

static hal_status_t backend_listener_bind(void *listener,
                                          const hal_net_endpoint_t *local) {
  return hal_tcp_listener_bind_ex(static_cast<hal_tcp_listener_t>(listener),
                                  local);
}

static hal_status_t backend_listener_listen(void *listener, uint8_t backlog) {
  return hal_tcp_listener_listen_ex(static_cast<hal_tcp_listener_t>(listener),
                                    backlog);
}

static hal_status_t backend_listener_accept(void *listener,
                                            hal_net_endpoint_t *remote,
                                            uint32_t timeout_ms,
                                            void **out_socket) {
  if (out_socket == nullptr) {
    return HAL_EINVAL;
  }
  hal_tcp_socket_t socket = nullptr;
  const hal_status_t status = hal_tcp_listener_accept_ex(
      static_cast<hal_tcp_listener_t>(listener), remote, timeout_ms, &socket);
  *out_socket = socket;
  return status;
}

static bool backend_listener_can_accept(void *listener) {
  return hal_tcp_listener_can_accept(static_cast<hal_tcp_listener_t>(listener));
}

static void backend_listener_close(void *listener) {
  hal_tcp_listener_close(static_cast<hal_tcp_listener_t>(listener));
}

extern "C" const jh_network_tcp_ops_t *jh_rp2040_cyw43_tcp_ops(void) {
  static const jh_network_tcp_ops_t ops = {
      backend_socket_open,         backend_socket_connect,
      backend_socket_send,         backend_socket_recv,
      backend_socket_can_recv,     backend_socket_can_send,
      backend_socket_is_connected, backend_socket_shutdown,
      backend_socket_close,        backend_listener_open,
      backend_listener_bind,       backend_listener_listen,
      backend_listener_accept,     backend_listener_can_accept,
      backend_listener_close,
  };
  return &ops;
}

#endif /* HAL_ENABLE_TCP */
#endif /* HAL_TARGET_IS_RP */
